mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
struct StorageType
{
  static const uint8_t SPIFFS = 0;
  static const uint8_t SD = 1;
};

class QueueInfo
{
public:
  QueueInfo();
  ~QueueInfo();
  uint8_t totalQueues();
  uint32_t currentQueueID();
  bool isQueueFull();
  String dataType();
  String firebaseMethod();
  String dataPath();

  friend FirebaseESP8266;

protected:
  void clear();
  uint8_t _totalQueue = 0;
  uint32_t _currentQueueID = 0;
  bool _isQueueFull = false;
  bool _isQueue = false;
  std::string _dataType = "";
  std::string _method = "";
  std::string _path = "";
};

struct QueueItem
{
  uint8_t firebaseDataType = 0;
  uint8_t firebaseMethod = 0;
  uint32_t qID = 0;
  uint32_t timestamp = 0;
  uint8_t runCount = 0;
  uint8_t runIndex = 0;
  uint8_t storageType = 0;

  std::string path = "";
  std::string payload = "";
  std::vector<uint8_t> blob = std::vector<uint8_t>();
  std::string filename = "";
  QueryFilter queryFilter;
  int *intPtr = nullptr;
  float *floatPtr = nullptr;
  double *doublePtr = nullptr;
  bool *boolPtr = nullptr;
  String *stringPtr = nullptr;
  FirebaseJson *jsonPtr = nullptr;
  FirebaseJsonArray *arrPtr = nullptr;
  std::vector<uint8_t> *blobPtr = nullptr;
};

class QueueManager
{
public:
  QueueManager();
  ~QueueManager();

  bool add(QueueItem q);
  void remove(uint8_t index);

  friend class FirebaseESP8266;
  friend class FirebaseData;

private:
  void clear();
  std::vector<QueueItem> _queueCollection = std::vector<QueueItem>();
  uint8_t _maxQueue = 10;
};

class FirebaseESP8266
{
public:
  struct FirebaseDataType;
  struct FirebaseMethod;
  struct FCMMessageType;

  FirebaseESP8266();
  ~FirebaseESP8266();

  /*
    Store Firebase's authentication credentials.

    @param host - Your Firebase database project host e.g. Your_ProjectID.firebaseio.com.
    @param auth - Your database secret.
    @param rootCA - Root CA certificate base64 string (PEM file).
    @param rootCAFile - Root CA certificate DER file (binary).
    @param StorageType - Type of storage, StorageType::SD and StorageType::SPIFFS.
    @param GMTOffset - GMT time offset in hour is required to set time in order to make BearSSL 
                       data decryption/encryption to work.
                       This parameter is only required for ESP8266 Core SDK v2.5.x or later.

    Root CA certificate DER file is only support in Core SDK v2.5.x

  */
  void begin(const String &host, const String &auth);

  void begin(const String &host, const String &auth, const char *rootCA, float GMTOffset = 0.0);

  void begin(const String &host, const String &auth, const String &rootCAFile, uint8_t storageType, float GMTOffset = 0.0);

  /*
    Reconnect WiFi if lost connection.

    @param reconnect - The boolean to set/unset WiFi AP reconnection.

  */
  void reconnectWiFi(bool reconnect);

  /*
    Enable low buffer memory for secured mode BearSSL WiFi client.

    @param enable - The boolean to enable/disable low buffer memory for secured mode BearSSL.

    Set this option to false to support get large Blob and File.

  */
  void lowMemBSSL(bool enable);

  /*
    Set the timeouts of get function.

    @param dataObj - Firebase Data Object to hold data and instances.

    @param millisec - The missiseconds to limit the request (0 - 900,000 ms or 15 min).

  */
  void setReadTimeout(FirebaseData &dataObj, int millisec);

  /*
    Set the timeouts of get function.

    @param dataObj - Firebase Data Object to hold data and instances.

    @param size - The size identified string e.g. tiny, small, medium, large and unlimited.

    Size string and its write timeout e.g. tiny (1s), small (10s), medium (30s) and large (60s).

  */
  void setwriteSizeLimit(FirebaseData &dataObj, const String &size);

  /*
    Read the database rules.

    @param dataObj - Firebase Data Object to hold data and instances.

    @return - Boolean type status indicates the success of operation.

    Call [FirebaseData object].jsonData will return the JSON string value of
    database rules returned from server.

  */
  bool getRules(FirebaseData &dataObj);

  /*
    Write the database rules.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param rules - Database rules in jSON String format.

    @return - Boolean type status indicates the success of operation.

  */
  bool setRules(FirebaseData &dataObj, const String &rules);

  /*
    Determine whether defined database path is existed or not.
    
    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Database path to be checked.

    @return - Boolean type result indicates whether the defined database
    path was existed or not.

   */
  bool pathExist(FirebaseData &dataObj, const String &path);

  /*
    Determine the unique identifier (ETag) of current data at the defined database path.

    @return String of unique identifier.

  */
  String getETag(FirebaseData &dataObj, const String &path);

  /*
    Get the shallowed data at defined node path.

    @param dataObj - Firebase Data Object to hold data and instances.

    @param path - Database path being read the data.

    @return - Boolean type status indicates the success of operation.

    Return the child data with its value or JSON object (its values will be truncated to true).

    Call [FirebaseData object].stringData() to get shallowed string data (number, string and JSON object).

  */
  bool getShallowData(FirebaseData &dataObj, const String &path);

  /*
    Enable the library to use only classic HTTP GET and POST methods.

    @param dataObj - Firebase Data Object to hold data and instances.

    @param flag - Boolean value to enable.

    This option used to escape the Firewall restriction (if device is connected through Firewall) that allows only HTTP GET and POST
    
    HTTP PATCH request was sent as PATCH which not affected by this option.

  */
  void enableClassicRequest(FirebaseData &dataObj, bool flag);

  /*
    Set the virtual child node ".priority" to the defined database path. 
    
    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Target database path which to set the prioity value.
    @param priority - The priority value.
    
    @return - Boolean type status indicates the success of operation.

    This allows us to set priority to any node other than priority that set through setJSON, pushJSON, updateNode and updateNodeSilent functions.
    
    The returned priority value from server can read from function [FirebaseData object].priority().

   */
  bool setPriority(FirebaseData &dataObj, const String &path, float priority);

