mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
  bool set(FirebaseData &dataObj, const String &path, bool boolValue);

  /*

    Set boolean data and virtual child ".priority" at the defined database path.

  */
  bool setBool(FirebaseData &dataObj, const String &path, bool boolValue, float priority);

  bool set(FirebaseData &dataObj, const String &path, bool boolValue, float priority);

  /*
    Set Boolean data at the defined database path if defined database path's ETag matched the ETag value.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Target database path which Boolean data will be set.
    @param boolValue - Boolean value to set.
    @param ETag - Known unique identifier string (ETag) of defined database path.

    @return - Boolean type status indicates the success of operation.

    Call [FirebaseData object].dataType to determine what type of data that successfully
    stores in database.

    Call [FirebaseData object].boolData will return the Boolean value of
    payload returned from server.

    If ETag at the defined database path is not match the provided ETag parameter,
    the operation will failed with HTTP code 412, Precondition Failed (ETag is not match).

    If operation failed due to ETag is not match, call [FirebaseData object].ETag() to get the current ETag value.
    Also call [FirebaseData object].doubeData to get the current boolean value.

  */
  bool setBool(FirebaseData &dataObj, const String &path, bool boolValue, const String &ETag);

  bool set(FirebaseData &dataObj, const String &path, bool boolValue, const String &ETag);

  /*

    Set boolean data and the virtual child ".priority" if defined ETag matches at the defined database path 

  */
  bool setBool(FirebaseData &dataObj, const String &path, bool boolValue, float priority, const String &ETag);

  bool set(FirebaseData &dataObj, const String &path, bool boolValue, float priority, const String &ETag);

  /*
    Set string (text) at the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Target database path which string data will be set.
    @param stringValue - String or text to set.

    @return - Boolean type status indicates the success of operation.

    Call [FirebaseData object].dataType to determine what type of data that successfully
    stores in database.

    Call [FirebaseData object].stringData will return the string value of
    payload returned from server.

  */
  bool setString(FirebaseData &dataObj, const String &path, const String &stringValue);

  bool set(FirebaseData &dataObj, const String &path, const char *stringValue);

  bool set(FirebaseData &dataObj, const String &path, const String &stringValue);

  /*

    Set string data and virtual child ".priority" at the defined database path.

  */
  bool setString(FirebaseData &dataObj, const String &path, const String &stringValue, float priority);

  bool set(FirebaseData &dataObj, const String &path, const char *stringValue, float priority);

  bool set(FirebaseData &dataObj, const String &path, const String &stringValue, float priority);

  /*
    Set string (text) at the defined database path if defined database path's ETag matched the ETag value.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Target database path which string data will be set.
    @param stringValue - String or text to set.
    @param ETag - Known unique identifier string (ETag) of defined database path.

    @return - Boolean type status indicates the success of operation.
    
    Call [FirebaseData object].dataType to determine what type of data that successfully
    stores in database. 
    
    Call [FirebaseData object].stringData will return the string value of
    payload returned from server.

    If ETag at the defined database path is not match the provided ETag parameter,
    the operation will failed with HTTP code 412, Precondition Failed (ETag is not match).

    If operation failed due to ETag is not match, call [FirebaseData object].ETag() to get the current ETag value.
    Also call [FirebaseData object].stringData to get the current string value.

   */
  bool setString(FirebaseData &dataObj, const String &path, const String &stringValue, const String &ETag);

  bool set(FirebaseData &dataObj, const String &path, const char *stringValue, const String &ETag);

  bool set(FirebaseData &dataObj, const String &path, const String &stringValue, const String &ETag);

  /*

    Set string data and the virtual child ".priority" if defined ETag matches at the defined database path 

  */
  bool setString(FirebaseData &dataObj, const String &path, const String &stringValue, float priority, const String &ETag);

  bool set(FirebaseData &dataObj, const String &path, const char *stringValue, float priority, const String &ETag);

  bool set(FirebaseData &dataObj, const String &path, const String &stringValue, float priority, const String &ETag);

  /*

    Set child nodes's key and value (using FirebaseJson object) to the defined database path.

    This will replace any child nodes inside the defined path with node' s key
    and value defined in FirebaseJson object.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Target database path which key and value in FirebaseJson object will be replaced or set.
    @param json - The FirebaseJson object.

    @return - Boolean type status indicates the success of operation.

    Call [FirebaseData object].dataType to determine what type of data that successfully
    stores in database.

    Call [FirebaseData object].jsonData will return the JSON string value of
    payload returned from server.

  */
  bool setJSON(FirebaseData &dataObj, const String &path, FirebaseJson &json);

  bool set(FirebaseData &dataObj, const String &path, FirebaseJson &json);

  /*

    Set JSON data or FirebaseJson object and virtual child ".priority" at the defined database path.

  */

  bool setJSON(FirebaseData &dataObj, const String &path, FirebaseJson &json, float priority);

  bool set(FirebaseData &dataObj, const String &path, FirebaseJson &json, float priority);

