mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
  /*
    Set blob (binary data) at the defined database path if defined database path's ETag matched the ETag value.

    This will replace any child nodes inside the defined path with blob or binary data.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Target database path which binary data will be set.
    @param blob - Byte array of data.
    @param size - Size of byte array.
    @param ETag - Known unique identifier string (ETag) of defined database path.

    @return - Boolean type status indicates the success of operation.
    
    No payload returned from server.

    If ETag at the defined database path is not match the provided ETag parameter,
    the operation will failed with HTTP code 412, Precondition Failed (ETag is not match).

   */
  bool setBlob(FirebaseData &dataObj, const String &path, uint8_t *blob, size_t size, const String &ETag);

  bool set(FirebaseData &dataObj, const String &path, uint8_t *blob, size_t size, const String &ETag);

  /*

    Set blob data and the virtual child ".priority" if defined ETag matches at the defined database path 

  */
  bool setBlob(FirebaseData &dataObj, const String &path, uint8_t *blob, size_t size, float priority, const String &ETag);

  bool set(FirebaseData &dataObj, const String &path, uint8_t *blob, size_t size, float priority, const String &ETag);

  /*
    Set binary data from file store on SD card/Flash memory to the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param storageType - Type of storage to read file data, StorageType::SPIFS or StorageType::SD.
    @param path - Target database path which binary data from file will be set.
    @param fileName - File name included its path in SD card/Flash memory

    @return - Boolean type status indicates the success of operation.

    No payload returned from server.

  */
  bool setFile(FirebaseData &dataObj, uint8_t storageType, const String &path, const String &fileName);

  bool set(FirebaseData &dataObj, uint8_t storageType, const String &path, const String &fileName);

  /*

    Set binary data from file and virtual child ".priority" at the defined database path.

  */
  bool setFile(FirebaseData &dataObj, uint8_t storageType, const String &path, const String &fileName, float priority);

  bool set(FirebaseData &dataObj, uint8_t storageType, const String &path, const String &fileName, float priority);

  /*
    Set binary data from file store on SD card/Flash memory to the defined database path if defined database path's ETag matched the ETag value.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param storageType - Type of storage to read file data, StorageType::SPIFS or StorageType::SD.
    @param path - Target database path which binary data from file will be set.
    @param fileName - File name included its path in SD card/Flash memory.
    @param ETag - Known unique identifier string (ETag) of defined database path.

    @return - Boolean type status indicates the success of operation.
    
    No payload returned from server.

    If ETag at the defined database path is not match the provided ETag parameter,
    the operation will failed with HTTP code 412, Precondition Failed (ETag is not match).

   */
  bool setFile(FirebaseData &dataObj, uint8_t storageType, const String &path, const String &fileName, const String &ETag);

  bool set(FirebaseData &dataObj, uint8_t storageType, const String &path, const String &fileName, const String &ETag);

  /*

    Set binary data from file and the virtual child ".priority" if defined ETag matches at the defined database path 

  */
  bool setFile(FirebaseData &dataObj, uint8_t storageType, const String &path, const String &fileName, float priority, const String &ETag);

  bool set(FirebaseData &dataObj, uint8_t storageType, const String &path, const String &fileName, float priority, const String &ETag);

  /*
    Set Firebase server's timestamp to the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Target database path which timestamp will be set.

    @return - Boolean type status indicates the success of operation.

    Call [FirebaseData object].intData will return the integer value of timestamp in seconds
    or [FirebaseData object].doubleData to get millisecond timestamp.

    Due to bugs in Serial.print in Arduino, to print large double value with zero decimal place, 
    use printf("%.0lf\n", firebaseData.doubleData());.

   */
  bool setTimestamp(FirebaseData &dataObj, const String &path);

  /*
    Update child nodes's key or exising key's value (using FirebaseJson object) under the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Target database path which key and value in FirebaseJson object will be update.
    @param json - The FirebaseJson object used for update.

    @return - Boolean type status indicates the success of operation.

    Call [FirebaseData object].dataType to determine what type of data that successfully
    stores in database.

    Call [FirebaseData object].jsonData will return the json string value of
    payload returned from server.

    To reduce the network data usage, use updateNodeSilent instead.

  */
  bool updateNode(FirebaseData &dataObj, const String path, FirebaseJson &json);

  /*

    Update child nodes's key or exising key's value and virtual child ".priority" (using JSON data or FirebaseJson object) under the defined database path.

  */

  bool updateNode(FirebaseData &dataObj, const String &path, FirebaseJson &json, float priority);

  /*
    Update child nodes's key or exising key's value (using FirebaseJson object) under the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Target database path which key and value in FirebaseJson object will be update.
    @param json - The FirebaseJson object used for update.

    @return - Boolean type status indicates the success of operation.

    Owing to the objective of this function to reduce the netwok data usage,
    no payload will be returned from server.

  */
  bool updateNodeSilent(FirebaseData &dataObj, const String &path, FirebaseJson &json);

