mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
    If the type of payload returned from server is not Boolean, 
    the target variable's value will be false.

   */
  bool getBool(FirebaseData &dataObj, const String &path, bool &target);

  /*
    Read the string or text at the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Database path which the string value is being read.

    @return - Boolean type status indicates the success of operation.

    Call [FirebaseData object].dataType to determine what type of data that successfully
    stores in database.

    Call [FirebaseData object].stringData will return the string value of
    payload returned from server.

    If the type of payload returned from server is not string,
    the function [FirebaseData object].stringData will return empty string (String object).

  */
  bool getString(FirebaseData &dataObj, const String &path);

  /*
    Read the string or text at the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Database path which the string value is being read.
    @param target - The String object to store value.

    @return - Boolean type status indicates the success of operation.

    If the type of payload returned from server is not string,
    the target String object's value will be empty.

  */
  bool getString(FirebaseData &dataObj, const String &path, String &target);

  /*
    Read the JSON string at the defined database path.
    The returned payload JSON string represents the child nodes and their value.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Database path which the JSON string value is being read.

    @return - Boolean type status indicates the success of operation.

    Call [FirebaseData object].dataType to determine what type of data that successfully
    stores in database.

    Call [FirebaseData object].jsonObject will return the pointer to FirebaseJson object contains the value of
    payload returned from server.

    If the type of payload returned from server is not json,
    the function [FirebaseData object].jsonObject will contain empty object.

  */
  bool getJSON(FirebaseData &dataObj, const String &path);

  /*
    Read the JSON string at the defined database path.
    The returned the pointer to FirebaseJson that contains json payload represents the child nodes and their value.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Database path which the JSON string value is being read.
    @param target - The FirebaseJson object pointer to get json data.

    @return - Boolean type status indicates the success of operation.

    If the type of payload returned from server is not json,
    the target FirebaseJson object will contain empty object.


  */
  bool getJSON(FirebaseData &dataObj, const String &path, FirebaseJson *target);

  /*
    Read the JSON string at the defined database path.
    The returned the pointer to FirebaseJson that contains json payload represents the child nodes and their value.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Database path which the JSON string value is being read.
    @param query - QueryFilter class to set query parameters to filter data.

    @return - Boolean type status indicates the success of operation.

    Available query parameters for filtering the data are the following.

    QueryFilter.orderBy -       Required parameter to specify which data used for data filtering included child key, key and value.
                                Use "$key" for filtering data by keys of all nodes at the defined database path.
                                Use "$value" for filtering data by value of all nodes at the defined database path.
                                Use "$priority" for filtering data by "virtual child" named .priority of all nodes.
                                Use  any child key to filter by that key.


    QueryFilter.limitToFirst -  The total children (number) to filter from the first child.
    QueryFilter.limitToLast -   The total last children (number) to filter.
    QueryFilter.startAt -       Starting value of range (number or string) of query upon orderBy param.
    QueryFilter.endAt -         Ending value of range (number or string) of query upon orderBy param.
    QueryFilter.equalTo -       Value (number or string) matches the orderBy param


    Call [FirebaseData object].dataType to determine what type of data that successfully
    stores in database.

    Call [FirebaseData object].jsonObject will return the pointer to FirebaseJson object contains the value of
    payload returned from server.

    If the type of payload returned from server is not json,
    the function [FirebaseData object].jsonObject will contain empty object.


  */
  bool getJSON(FirebaseData &dataObj, const String &path, QueryFilter &query);

  /*
     Read the JSON string at the defined database path as above

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Database path which the JSON string value is being read.
    @param target - The FirebaseJson object pointer to get json data.

    @return - Boolean type status indicates the success of operation.

    If the type of payload returned from server is not json,
    the target FirebaseJson object will contain empty object.

  */
  bool getJSON(FirebaseData &dataObj, const String &path, QueryFilter &query, FirebaseJson *target);

  /*
    Read the array data at the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Database path which the array is being read.

    @return - Boolean type status indicates the success of operation.

    Call [FirebaseData object].dataType to determine what type of data that successfully
    stores in database.

    Call [FirebaseData object].jsonArray will return the pointer to FirebaseJsonArray object contains array value of
    payload returned from server.

