mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
    If the type of payload returned from server is not array,
    the array element in [FirebaseData object].jsonArray will be empty.

  */
  bool getArray(FirebaseData &dataObj, const String &path);

  /*
    Read the array data at the defined database path, and assign data to target.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Database path which the array is being read.
    @param target - The FirebaseJsonArray object pointer to get array value.

    @return - Boolean type status indicates the success of operation.

    If the type of payload returned from server is not array,
    the target FirebaseJsonArray object will contain empty array.

  */
  bool getArray(FirebaseData &dataObj, const String &path, FirebaseJsonArray *target);

  /*
    Read the array data at the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Database path which the array is being read.
    @param query - QueryFilter class to set query parameters to filter data.

    @return - Boolean type status indicates the success of operation.

    Available query parameters for filtering the data are the following.

    QueryFilter.orderBy -       Required parameter to specify which data used for data filtering included child key, key and value.
                                Use "$key" for filtering data by keys of all nodes at the defined database path.
                                Use "$value" for filtering data by value of all nodes at the defined database path.
                                Use "$priority" for filtering data by "virtual child" named .priority of all nodes.
                                Use  any child key to filter by that key.


    QueryFilter.limitToFirst -  The total children (number) to filter from the first child.
    QueryFilter.limitToLast -   The total last children (number) to filter.
    QueryFilter.startAt -       Starting value of range (number or string) of query upon orderBy param.
    QueryFilter.endAt -         Ending value of range (number or string) of query upon orderBy param.
    QueryFilter.equalTo -       Value (number or string) matches the orderBy param


    Call [FirebaseData object].dataType to determine what type of data that successfully
    stores in database.

    Call [FirebaseData object].jsonArray will return the pointer to FirebaseJsonArray object contains array of
    payload returned from server.

    If the type of payload returned from server is not array,
    the function [FirebaseData object].jsonArray will contain empty array.


  */
  bool getArray(FirebaseData &dataObj, const String &path, QueryFilter &query);

  /*
    Read the array data at the defined database path as above

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Database path which the array is being read.
    @param target - The FirebaseJsonArray object to get array value.

    @return - Boolean type status indicates the success of operation.

    If the type of payload returned from server is not array,
    the target FirebaseJsonArray object will contain empty array.

  */
  bool getArray(FirebaseData &dataObj, const String &path, QueryFilter &query, FirebaseJsonArray *target);

  /*
    Read the blob (binary data) at the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Database path which the binary data is being read.

    @return - Boolean type status indicates the success of operation.

    Call [FirebaseData object].dataType to determine what type of data that successfully
    stores in database.

    Call [FirebaseData object].blobData will return the dynamic array of unsigned 8-bit data (i.e. std::vector<uint8_t>) of
    payload returned from server.

    If the type of payload returned from server is not blob,
    the function [FirebaseData object].blobData will return empty array.

  */
  bool getBlob(FirebaseData &dataObj, const String &path);

  /*
    Read the blob (binary data) at the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Database path which the binary data is being read.
    @param target - Dynamic array of unsigned 8-bit data (i.e. std::vector<uint8_t>) to store value.

    @return - Boolean type status indicates the success of operation.


    If the type of payload returned from server is not blob,
    the target variable value will be empty array.

  */
  bool getBlob(FirebaseData &dataObj, const String &path, std::vector<uint8_t> &target);

  /*
    Download file data in database at defined database path and save to SD card/Flash memory.

    The downloaded data will be decoded to binary and save to SD card/Flash memory, then
    please make sure that data at the defined database path is file type.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param storageType - Type of storage to write file data, StorageType::SPIFS or StorageType::SD.
    @param nodePath - Database path that file data will be downloaded.
    @param fileName - File name included its path in SD card/Flash memory.
    to save in SD card/Flash memory.

    @return Boolean type status indicates the success of operation.

  */
  bool getFile(FirebaseData &dataObj, uint8_t storageType, const String &nodePath, const String &fileName);

  /*
    Delete all child nodes at the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Database path to be deleted.

    @return - Boolean type status indicates the success of operation.

  */
  bool deleteNode(FirebaseData &dataObj, const String &path);

  /*
    Delete all child nodes at the defined database path if defined database path's ETag matched the ETag value.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Database path to be deleted.
    @param ETag - Known unique identifier string (ETag) of defined database path.

    @return - Boolean type status indicates the success of operation.

    If ETag at the defined database path is not match the provided ETag parameter,
    the operation will failed with HTTP code 412, Precondition Failed (ETag is not match).

   */
  bool deleteNode(FirebaseData &dataObj, const String &path, const String &ETag);

