mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
  /*
    Start monitoring the value changes at the defined path and its children.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Database path being monitor.

    @return - Boolean type status indicates the success of operation.

  */
  bool beginStream(FirebaseData &dataObj, const String path);

  /*
    Read the stream event data at defined database path.

    Once beginStream was called e.g. in setup(), the readStream function
    should call inside the loop function.

    @param dataObj - Firebase Data Object to hold data and instances.

    @return - Boolean type status indicates the success of operation.

    Using the same Firebase Data object for stream read/monitoring associated
    with getXXX, setXXX, pushXXX, updateNode and deleteNode will break or quit
    the current stream connection.

    The stream will be resumed or reconnected automatically when calling readStream.

  */
  bool readStream(FirebaseData &dataObj);

  /*
    End the stream connection at defined path.

    Can be restart again by calling beginStream.

    @param dataObj - Firebase Data Object to hold data and instances.

    @return - Boolean type status indicates the success of operation.

  */
  bool endStream(FirebaseData &dataObj);

  /*
    Set the stream callback functions.

    setStreamCallback should be called before Firebase.beginStream.
    
    @param dataObj - Firebase Data Object to hold data and instances.
    @param dataAvailablecallback - Callback function that accepts streamData parameter.
    @param timeoutCallback - Callback function will be called when stream connection was timeout (optional).

    dataAvailablecallback will be called When data in the defined path changed or the stream path changed or stream connection
    was resumed from getXXX, setXXX, pushXXX, updateNode, deleteNode.

    The payload returned from server will be one of these integer, float, string, json and blob types.

    Call [streamData object].dataType to determine what type of data that successfully
    stores in database. 
    
    Call [streamData object].xxxData will return the appropiated data type of
    payload returned from server.

   */
  void setStreamCallback(FirebaseData &dataObj, StreamEventCallback dataAvailablecallback, StreamTimeoutCallback timeoutCallback = NULL);

  /*
    Remove stream callback functions.

    @param dataObj - Firebase Data Object to hold data and instances.
   */
  void removeStreamCallback(FirebaseData &dataObj);

  /*
    Backup (download) database at defined database path to SD card/Flash memory.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param storageType - Type of storage to save file, StorageType::SPIFS or StorageType::SD.
    @param nodePath - Database path to be backuped.
    @param fileName - File name to save.
    
    Only 8.3 DOS format (max. 8 bytes file name and 3 bytes file extension) can be saved to SD card/Flash memory.

    @return Boolean type status indicates the success of operation.


  */
  bool backup(FirebaseData &dataObj, uint8_t storageType, const String &nodePath, const String &fileName);

  /*
    Restore database at defined path usin backup file saved on SD card/Flash memory.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param storageType - Type of storage to read file, StorageType::SPIFS or StorageType::SD.
    @param nodePath - Database path to  be restored.
    @param fileName - File name to read

    @return Boolean type status indicates the success of operation.

  */
  bool restore(FirebaseData &dataObj, uint8_t storageType, const String &nodePath, const String &fileName);

  /*

    Set maximum Firebase read/store retry operation (0 - 255) in case of network problems and buffer overflow.
    @param dataObj - Firebase Data Object to hold data and instances.
    @param num - The maximum retry.

  */
  void setMaxRetry(FirebaseData &dataObj, uint8_t num);

  /*
   
   Set the maximum Firebase Error Queues in collection (0 - 255).

   Firebase read/store operation causes by network problems and buffer overflow will be added to Firebase Error Queues collection.

   @param dataObj - Firebase Data Object to hold data and instances.
   @param num - The maximum Firebase Error Queues.

  */
  void setMaxErrorQueue(FirebaseData &dataObj, uint8_t num);

  /*
   
   Save Firebase Error Queues as SPIFFS file (save only database store queues).

   Firebase read (get) operation will not be saved.

   @param dataObj - Firebase Data Object to hold data and instances.
   @param filename - File name to be saved.
   @param storageType - Type of storage to save file, StorageType::SPIFS or StorageType::SD.
    
  */
  bool saveErrorQueue(FirebaseData &dataObj, const String &filename, uint8_t storageType);

  /*
   
   Delete file in Flash (SPIFFS) or SD card.

   @param filename - File name to delete.
   @param storageType - Type of storage to save file, StorageType::SPIFS or StorageType::SD.
    
  */
  bool deleteStorageFile(const String &filename, uint8_t storageType);

  /*
   
   Restore Firebase Error Queues from SPIFFS file.

   @param dataObj - Firebase Data Object to hold data and instances.
   @param filename - File name to be read and restore queues.
   @param storageType - Type of storage to read file, StorageType::SPIFS or StorageType::SD.
    
  */
  bool restoreErrorQueue(FirebaseData &dataObj, const String &filename, uint8_t storageType);

  /*
    Determine number of Firebase Error Queues stored in defined SPIFFS file.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param filename - File name to be read and count for queues.
    @param storageType - Type of storage to read file, StorageType::SPIFS or StorageType::SD.

    @return Number (0-255) of queues store in defined SPIFFS file.

  */
  uint8_t errorQueueCount(FirebaseData &dataObj, const String &filename, uint8_t storageType);

  /*
    Determine number of queues in Firebase Data object Firebase Error Queues collection.

    @param dataObj - Firebase Data Object to hold data and instances.
    @return Number (0-255) of queues in Firebase Data object queue collection.

  */
  uint8_t errorQueueCount(FirebaseData &dataObj);

