mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
  /*
    Determine whether the  Firebase Error Queues collection was full or not.

    @param dataObj - Firebase Data Object to hold data and instances.

    @return Boolean type status indicates whether the  Firebase Error Queues collection was full or not.

  */
  bool isErrorQueueFull(FirebaseData &dataObj);

  /*
    Pocess all failed Firebase operation queue items when network is available.

    @param dataObj - Firebase Data Object to hold data and instances.

    @param callback - Callback function that accepts QueueInfo parameter.
  
  */
  void processErrorQueue(FirebaseData &dataObj, QueueInfoCallback callback = NULL);

  /*
    Return Firebase Error Queue ID of last Firebase Error.

    Return 0 if there is no Firebase Error from last operation.

    @param dataObj - Firebase Data Object to hold data and instances.
    
    @return Number of Queue ID.

   */
  uint32_t getErrorQueueID(FirebaseData &dataObj);

  /*
    Determine whether Firebase Error Queue is currently exsted is Error Queue collection or not.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param errorQueueID - The Firebase Error Queue ID get from getErrorQueueID.
    
   @return - Boolean type status indicates the queue existence.

   */
  bool isErrorQueueExisted(FirebaseData &dataObj, uint32_t errorQueueID);

  /*
    Start the Firbase Error Queues Auto Run Process.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param callback - Callback function that accepts QueueInfo Object as parameter, optional.

    The following functions are available from QueueInfo Object accepted by callback.

    queueInfo.totalQueues(), get the total Error Queues in Error Queue Collection.

    queueInfo.currentQueueID(), get current Error Queue ID that being process.

    queueInfo.isQueueFull(), determine whether Error Queue Collection is full or not.

    queueInfo.dataType(), get string of the Frebase call data type that being process of current Error Queue.

    queueInfo.method(), get string of the Firebase call method that being process of current Error Queue.

    queueInfo.path(), get string of the Firebase call path that being process of current Error Queue.

   */
  void beginAutoRunErrorQueue(FirebaseData &dataObj, QueueInfoCallback callback = NULL);

  /*
    Stop the Firbase Error Queues Auto Run Process.

    @param dataObj - Firebase Data Object to hold data and instances.

  */
  void endAutoRunErrorQueue(FirebaseData &dataObj);

  /*
    Clear all Firbase Error Queues in Error Queue collection.

    @param dataObj - Firebase Data Object to hold data and instances.

  */
  void clearErrorQueue(FirebaseData &dataObj);

  /*
    Send Firebase Cloud Messaging to device with first registeration token which added by firebaseData.fcm.addDeviceToken.

    @param dataObj - Firebase Data Object to hold data and instances.

    @param index - The index (starts from 0) of recipient device token which added by firebaseData.fcm.addDeviceToken
    
    @return - Boolean type status indicates the success of operation.

   */
  bool sendMessage(FirebaseData &dataObj, uint16_t index);

  /*
    Send Firebase Cloud Messaging to all devices (multicast) which added by firebaseData.fcm.addDeviceToken.

    @param dataObj - Firebase Data Object to hold data and instances.
    
    @return - Boolean type status indicates the success of operation.

   */
  bool broadcastMessage(FirebaseData &dataObj);

  /*
    Send Firebase Cloud Messaging to devices that subscribed to topic.

    @param dataObj - Firebase Data Object to hold data and instances.
    
    @return - Boolean type status indicates the success of operation.

   */
  bool sendTopic(FirebaseData &dataObj);

  void errorToString(int httpCode, std::string &buff);

  template <typename T>
  bool set(FirebaseData &dataObj, const String &path, T value);

  template <typename T>
  bool set(FirebaseData &dataObj, const String &path, T value, size_t size);

  template <typename T>
  bool set(FirebaseData &dataObj, const String &path, T value, float priority);

  template <typename T>
  bool set(FirebaseData &dataObj, const String &path, T value, size_t size, float priority);

  template <typename T>
  bool set(FirebaseData &dataObj, const String &path, T value, const String &ETag);

  template <typename T>
  bool set(FirebaseData &dataObj, const String &path, T value, size_t size, const String &ETag);

  template <typename T>
  bool set(FirebaseData &dataObj, const String &path, T value, float priority, const String &ETag);

  template <typename T>
  bool set(FirebaseData &dataObj, const String &path, T value, size_t size, float priority, const String &ETag);

  template <typename T>
  bool push(FirebaseData &dataObj, const String &path, T value);

  template <typename T>
  bool push(FirebaseData &dataObj, const String &path, T value, size_t size);

  template <typename T>
  bool push(FirebaseData &dataObj, const String &path, T value, float priority);

  template <typename T>
  bool push(FirebaseData &dataObj, const String &path, T value, size_t size, float priority);

private:
  callback_function_t _callback_function = nullptr;

  bool pushInt(FirebaseData &dataObj, const std::string &path, int intValue, bool queue, const std::string &priority);
  bool pushFloat(FirebaseData &dataObj, const std::string &path, float floatValue, bool queue, const std::string &priority);
  bool pushDouble(FirebaseData &dataObj, const std::string &path, double doubleValue, bool queue, const std::string &priority);
  bool pushBool(FirebaseData &dataObj, const std::string &path, bool boolValue, bool queue, const std::string &priority);
  bool pushBlob(FirebaseData &dataObj, const std::string &path, uint8_t *blob, size_t size, bool queue, const std::string &priority);
  bool setInt(FirebaseData &dataObj, const std::string &path, int intValue, bool queue, const std::string &priority, const std::string &etag);
  bool setFloat(FirebaseData &dataObj, const std::string &path, float floatValue, bool queue, const std::string &priority, const std::string &etag);
  bool setDouble(FirebaseData &dataObj, const std::string &path, double doubleValue, bool queue, const std::string &priority, const std::string &etag);
  bool setBool(FirebaseData &dataObj, const std::string &path, bool boolValue, bool queue, const std::string &priority, const std::string &etag);
  bool setBlob(FirebaseData &dataObj, const std::string &path, uint8_t *blob, size_t size, bool queue, const std::string &priority, const std::string &etag);

  bool buildRequest(FirebaseData &dataObj, uint8_t firebaseMethod, uint8_t firebaseDataType, const std::string &path, const char *buff, bool queue, const std::string &priority, const std::string &etag = "");
  bool buildRequestFile(FirebaseData &dataObj, uint8_t storageType, uint8_t firebaseMethod, const std::string &path, const std::string &fileName, bool queue, const std::string &priority, const std::string &etag = "");
  bool sendRequest(FirebaseData &dataObj, uint8_t storageType, const std::string &path, const uint8_t method, uint8_t dataType, const std::string &payload, const std::string &priority, const std::string &etag);
  void sendFirebaseRequest(FirebaseData &dataObj, const char *host, uint8_t method, uint8_t dataType, const char *path, const char *auth, size_t payloadLength);
  void endFileTransfer(FirebaseData &dataObj);
  bool firebaseConnectStream(FirebaseData &dataObj, const std::string &path);
  bool getServerStreamResponse(FirebaseData &dataObj);

  bool getServerResponse(FirebaseData &dataObj);
  bool getDownloadResponse(FirebaseData &dataObj);
  bool getUploadResponse(FirebaseData &dataObj);
  bool clientAvailable(FirebaseData &dataObj, bool available);

  void sendHeader(FirebaseData &dataObj, const char *host, uint8_t _method, const char *path, const char *auth, size_t payloadLength);
  void resetFirebasedataFlag(FirebaseData &dataObj);
  bool handleNetClientNotConnected(FirebaseData &dataObj);
  bool reconnect(FirebaseData &dataObj);
  bool reconnect();
  void forceEndHTTP(FirebaseData &dataObj);
  bool apConnected(FirebaseData &dataObj);
  int firebaseConnect(FirebaseData &dataObj, const std::string &path, const uint8_t method, uint8_t dataType, const std::string &payload, const std::string &priority);
  bool cancelCurrentResponse(FirebaseData &dataObj);
  void setDataType(FirebaseData &dataObj, const char *data);
  void setSecure(FirebaseData &dataObj);
  bool commError(FirebaseData &dataObj);
  uint8_t openErrorQueue(FirebaseData &dataObj, const String &filename, uint8_t storageType, uint8_t mode);
  std::vector<std::string> splitString(int size, const char *str, const char delim);

  void processFirebaseStream();
  void processAllErrorQueues();

  void p_memCopy(std::string &buff, const char *p, bool empty = false);
  bool sdTest();
  void createDirs(std::string dirs, uint8_t storageType);
  bool replace(std::string &str, const std::string &from, const std::string &to);
  std::string base64_encode_string(const unsigned char *src, size_t len);
  void send_base64_encode_file(SSL_CLIENT *ssl_client, const std::string &filePath, uint8_t storageType);
  bool base64_decode_string(const std::string src, std::vector<uint8_t> &out);
  bool base64_decode_file(File &file, const char *src, size_t len);
  bool base64_decode_SPIFFS(fs::File &file, const char *src, size_t len);

  bool sendFCMMessage(FirebaseData &dataObj, uint8_t messageType);

  void strcat_c(char *str, char c);
  int strpos(const char *haystack, const char *needle, int offset);
  int rstrpos(const char *haystack, const char *needle, int offset);
  char *rstrstr(const char *haystack, const char *needle);
  void setClock(float offset);

  void set_scheduled_callback(callback_function_t callback)
  {
    _callback_function = std::move([callback]() { schedule_function(callback); });
    _callback_function();
  }

  std::string _host = "";
  std::string _auth = "";
  std::string _rootCAFile = "";
  uint8_t _rootCAFileStoreageType = StorageType::SPIFFS;
  uint16_t _port = 443;
  uint8_t _sdPin = 15;
  std::shared_ptr<const char> _rootCA = nullptr;
  bool _reconnectWiFi = false;
  bool _bsslLowBuf = true;
  bool _sdOk = false;
  bool _sdInUse = false;
  bool _clockReady = false;
  unsigned long _lastReconnectMillis = 0;
  uint16_t _reconnectTimeout = 10000;
  File file;
  fs::File _file;
  float _gmtOffset = 0.0;
};

class FirebaseData
{

