mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
public:
  FirebaseData();
  ~FirebaseData();

  /*

    Get WiFi client instance.

    @return - WiFi client instance.

  */
  SSL_CLIENT *getWiFiClient();

  /*

    Pause/Unpause WiFiClient from all Firebase operations.

    @param pause The boolean to set/unset pause operation.

    @return - Boolean type status indicates the success of operation.

  */
  bool pauseFirebase(bool pause);

  /*

    Determine the data type of payload returned from server.

    @return The one of these data type e.g. integer, float, string, json and blob.

  */
  String dataType();

  /*
    Determine the event type of stream.

    @return The one of these event type e.g. put, patch, cancel, and auth_revoked.

    The event type "put" indicated that data at event path relative to stream path was completely changed. Event path can be determined from dataPath().

    The event type "patch" indicated that data at event path relative to stream path was updated. Event path can be determined from dataPath().

    The event type "cancel" indeicated something wrong and cancel by server.

    The event type "auth_revoked" indicated the provided Firebase Authentication Data (Database secret) is no longer valid.

   */
  String eventType();

  /*
    Determine the unique identifier (ETag) of current data.

    @return String of unique identifier.

  */
  String ETag();

  /*

    Determine the current stream path.

    @return The database streaming path.

  */
  String streamPath();

  /*

    Determine the current data path.

    @return The database path which belong to server's returned payload.

    The database path returned from this function in case of stream, also changed up on the child or parent's stream
    value changes.

  */
  String dataPath();

  /*

    Determine the error reason String from process.

    @return The error description string (String object).

  */
  String errorReason();

  /*

    Return the ineger data of server returned payload.

    @return Integer value.

  */
  int intData();

  /*

    Return the float data of server returned payload.

    @return Float value.

  */
  float floatData();

  /*

    Return the double data of server returned payload.

    @return double value.

  */
  double doubleData();

  /*

    Return the Boolean data of server returned payload.

    @return Boolean value.

  */
  bool boolData();

  /*

    Return the String data of server returned payload.

    @return String (String object).

  */
  String stringData();

  /*

    Return the JSON String data of server returned payload.

    @return String (String object).

  */
  String jsonString();

  /*

    Return the Firebase JSON object of server returned payload.

    @return FirebaseJson object.

  */

  FirebaseJson &jsonObject();

  /*

    Return the Firebase JSON object pointer of server returned payload.

    @return FirebaseJson object pointer.

  */
  FirebaseJson *jsonObjectPtr();

  /*

    Return the Firebase JSON Array object of server returned payload.

    @return FirebaseJsonArray object.

  */
  FirebaseJsonArray &jsonArray();

  /*

    Return the Firebase JSON Array object pointer of server returned payload.

    @return FirebaseJsonArray object pointer.

  */
  FirebaseJsonArray *jsonArrayPtr();

  /*

    Return the Firebase JSON Data object that keep the get(parse) result.

    @return FirebaseJsonData object.

  */
  FirebaseJsonData &jsonData();

  /*

    Return the Firebase JSON Data object pointer that keep the get(parse) result.

    @return FirebaseJsonData object pointer.

  */
  FirebaseJsonData *jsonDataPtr();

  /*

    Return the blob data (uint8_t) array of server returned payload.

    @return Dynamic array of 8-bit unsigned integer i.e. std::vector<uint8_t>.

  */
  std::vector<uint8_t> blobData();

  /*

    Return the new appended node's name or key of server returned payload when calling pushXXX function.

    @return String (String object).

  */
  String pushName();

  /*

    Determine the stream connection status.

    @return Boolean type status indicates whether the Firebase Data object is working with stream or not.

  */
  bool isStream();

  /*

    Determine the server connection status.

    @return Boolean type status indicates whether the Firebase Data object is connected to server or not.

  */
  bool httpConnected();

  /*

    Determine the timeout event of server's stream (30 sec is default).

    Nothing to do when stream connection timeout, the stream connection will be automatic resumed.

    @return Boolean type status indicates whether the stream was timeout or not.

  */
  bool streamTimeout();

  /*

    Determine the availability of data or paylaod returned from server.

    @return Boolean type status indicates whether the server return back the new payload or not.

  */
  bool dataAvailable();

  /*

    Determine the availability of stream event-data paylaod returned from server.

    @return Boolean type status indicates whether the server return back the stream event-data
    payload or not.

  */
  bool streamAvailable();

  /*

    Determine the matching between data type that intend to get from/store to database and the server's return payload data type.

    @return Boolean type status indicates whether the type of data being get from/store to database
    and server's returned payload are matched or not.

  */
  bool mismatchDataType();

  /*

    Determine the http status code return from server.

    @return integer number of HTTP status.

  */
  int httpCode();

  /*

    Check overflow of the returned payload data buffer.

    @return The overflow status.

    Default buffer size is 400 bytes, assigned via FIREBASE_RESPONSE_SIZE macro in FirebaseESP8266.h

  */
  bool bufferOverflow();

  /*

    Determine the name (full path) of backup file in SD card/Flash memory.

    @return String (String object) of file name that store on SD card/Flash memory after backup operation.

  */
  String getBackupFilename();

  /*

    Determine the size of backup file.

    @return Size of backup file in byte after backup operation.

  */
  size_t getBackupFileSize();

